In [27]:
import numpy as np
a = np.array([1, 2, 3, 4])
print(type(a), a.shape, a.dtype)

<class 'numpy.ndarray'> (4,) int64

In [8]:
arrr = np.array([
    [2, 450, 90, 9],
    [21, 90, 645, 45]
])

In [3]:
arr.size

8

In [4]:
arr.shape

(2, 4)

In [5]:
arr[0,0]

np.int64(2)

In [6]:
arr = np.array([
    [2,45,65,32,26],
    [3,14,5,65,56],
    [24,42,57,75,1]
])

In [9]:
arr[0:1]

array([[ 2, 45, 65, 32, 26]])

In [13]:
arr[2, 0:2]

array([24, 42])

In [15]:
np.eye(9)

array([[1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1.]])

In [17]:
res = np.empty((2,3))

In [18]:

res

array([[6.23042070e-307, 1.33512376e-306, 1.11261230e-306],
       [7.56577399e-307, 9.34600963e-307, 1.05699581e-307]])

In [ ]:
arr = np.array([[0., 0., 0., 0., 0.],
                [0., 0., 0., 0., 0.],
                [0., 0., 0., 0., 0.],
                [0., 0., 0., 0., 0.],
                [0., 0., 0., 0., 0.]])

In [1]:
import numpy as np
import pandas as pd

In [4]:
names = ["Ajay", "Harsh", "Rahul", "Sunny", "Vinay"]

In [6]:
namesSeries = pd.Series(names, index= ["S1", "S2", "S3", "S4", "S5"])
namesSeries

S1     Ajay
S2    Harsh
S3    Rahul
S4    Sunny
S5    Vinay
dtype: object

In [5]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_excel("file_example_XLS_100.xls")
df

      0 First Name   Last Name  Gender        Country  Age        Date    Id
0     1      Dulce       Abril  Female  United States   32  15/10/2017  1562
1     2       Mara   Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     3     Philip        Gent    Male         France   36  21/05/2015  2587
3     4   Kathleen      Hanner  Female  United States   25  15/10/2017  3549
4     5    Nereida     Magwood  Female  United States   58  16/08/2016  2468
..  ...        ...         ...     ...            ...  ...         ...   ...
95   96       Roma  Lafollette  Female  United States   34  15/10/2017  2654
96   97     Felisa        Cail  Female  United States   28  16/08/2016  6525
97   98   Demetria       Abbey  Female  United States   32  21/05/2015  3265
98   99     Jeromy        Danz    Male  United States   39  15/10/2017  3265
99  100   Rasheeda      Alkire  Female  United States   29  16/08/2016  6125

[100 rows x 8 columns]

In [12]:
df.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

In [13]:
df.shape

(100, 8)

In [16]:
df.columns

Index([0, 'First Name', 'Last Name', 'Gender', 'Country', 'Age', 'Date', 'Id'], dtype='object')

In [19]:
df = pd.read_excel("file_example_XLS_100.xls", sheet_name="Sheet2")
df

   Name       |  Age       |  Gender
0                                NaN
1   vinay          23           Male
2                                NaN
3  sidhart        22           Male
4                                NaN
5    amit           19          Male
6                                NaN
7   shruti         20         Female
8                                NaN
9   preeti         20         Female

In [23]:
df.iloc[5:11]

     0 First Name Last Name  Gender        Country  Age        Date    Id
5    6     Gaston     Brumm    Male  United States   24  21/05/2015  2554
6    7       Etta      Hurn  Female  Great Britain   56  15/10/2017  3598
7    8    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8    9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548
9   10     Fallon   Winward  Female  Great Britain   28  16/08/2016  5486
10  11    Arcelia    Bouska  Female  Great Britain   39  21/05/2015  1258

In [27]:
df.loc[5, ["First Name"]]

First Name    Gaston
Name: 5, dtype: object

In [28]:
df.loc[5:11, ["First Name", "Country"]]

   First Name        Country
5      Gaston  United States
6        Etta  Great Britain
7     Earlean  United States
8    Vincenza  United States
9      Fallon  Great Britain
10    Arcelia  Great Britain
11   Franklyn         France

In [30]:
df.iloc[5:11, 1:4]

   First Name Last Name  Gender
5      Gaston     Brumm    Male
6        Etta      Hurn  Female
7     Earlean    Melgar  Female
8    Vincenza   Weiland  Female
9      Fallon   Winward  Female
10    Arcelia    Bouska  Female

In [31]:
df[df.Gender == "Male"]

     0 First Name  Last Name Gender        Country  Age        Date    Id
2    3     Philip       Gent   Male         France   36  21/05/2015  2587
5    6     Gaston      Brumm   Male  United States   24  21/05/2015  2554
11  12   Franklyn     Unknow   Male         France   38  15/10/2017  2579
13  14     Marcel  Zabriskie   Male  Great Britain   26  21/05/2015  2587
24  25     Lester    Prothro   Male         France   21  15/10/2017  6574
28  29      Garth      Gangi   Male  United States   41  16/08/2016  3256
34  35     Dewitt     Borger   Male  United States   36  21/05/2015  8514
39  40      Chase     Karner   Male  United States   37  15/10/2017  2154
40  41     Tommie  Underdahl   Male  United States   26  16/08/2016  3265
42  43      Angel      Sanor   Male         France   24  15/10/2017  3259
44  45     Weston    Martina   Male  United States   26  21/05/2015  6540
48  49     Jeromy       Danz   Male  United States   39  15/10/2017  3265
52  53     Philip       Gent   Male         France   36  21/05/2015  2587
55  56     Gaston      Brumm   Male  United States   24  21/05/2015  2554
61  62   Franklyn     Unknow   Male         France   38  15/10/2017  2579
63  64     Marcel  Zabriskie   Male  Great Britain   26  21/05/2015  2587
74  75     Lester    Prothro   Male         France   21  15/10/2017  6574
78  79      Garth      Gangi   Male  United States   41  16/08/2016  3256
84  85     Dewitt     Borger   Male  United States   36  21/05/2015  8514
89  90      Chase     Karner   Male  United States   37  15/10/2017  2154
90  91     Tommie  Underdahl   Male  United States   26  16/08/2016  3265
92  93      Angel      Sanor   Male         France   24  15/10/2017  3259
94  95     Weston    Martina   Male  United States   26  21/05/2015  6540
98  99     Jeromy       Danz   Male  United States   39  15/10/2017  3265

In [ ]:
# ye 9/11/25 ka hai isko pdhna hai aaaj
df.isnull().sum()

0             0
First Name    0
Last Name     0
Gender        0
Country       0
Age           0
Date          0
Id            0
dtype: int64

In [ ]:
df.fillna(0)

      0 First Name   Last Name  Gender        Country  Age        Date    Id
0     1      Dulce       Abril  Female  United States   32  15/10/2017  1562
1     2       Mara   Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     3     Philip        Gent    Male         France   36  21/05/2015  2587
3     4   Kathleen      Hanner  Female  United States   25  15/10/2017  3549
4     5    Nereida     Magwood  Female  United States   58  16/08/2016  2468
..  ...        ...         ...     ...            ...  ...         ...   ...
95   96       Roma  Lafollette  Female  United States   34  15/10/2017  2654
96   97     Felisa        Cail  Female  United States   28  16/08/2016  6525
97   98   Demetria       Abbey  Female  United States   32  21/05/2015  3265
98   99     Jeromy        Danz    Male  United States   39  15/10/2017  3265
99  100   Rasheeda      Alkire  Female  United States   29  16/08/2016  6125

[100 rows x 8 columns]

In [10]:

df.fillna(0, inplace= True)
df

      0 First Name   Last Name  Gender        Country  Age        Date    Id
0     1      Dulce       Abril  Female  United States   32  15/10/2017  1562
1     2       Mara   Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     3     Philip        Gent    Male         France   36  21/05/2015  2587
3     4   Kathleen      Hanner  Female  United States   25  15/10/2017  3549
4     5    Nereida     Magwood  Female  United States   58  16/08/2016  2468
..  ...        ...         ...     ...            ...  ...         ...   ...
95   96       Roma  Lafollette  Female  United States   34  15/10/2017  2654
96   97     Felisa        Cail  Female  United States   28  16/08/2016  6525
97   98   Demetria       Abbey  Female  United States   32  21/05/2015  3265
98   99     Jeromy        Danz    Male  United States   39  15/10/2017  3265
99  100   Rasheeda      Alkire  Female  United States   29  16/08/2016  6125

[100 rows x 8 columns]

In [11]:
# df["salary"],replace[50000, 55000, inplace = True, limit = 2]
# isko column me bhi likhna hai ye krke dekhna hai

In [2]:
df = pd.read_csv("Titanic-Dataset.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
df.fillna(0 , inplace= True)

In [ ]:
df["Cabin"] = df["Cabin"].replace(0, 1)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,1,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,1,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,1,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,1,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,1,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,1,Q

In [19]:
df.drop(0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,1,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,1,S
5,6,0,3,"Moran, Mr. James",male,0.0,0,0,330877,8.4583,1,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,1,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,1,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,1,Q

In [24]:
# df = df.drop('survived', axis=1)
df.drop([2,4], axis=0,inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,1,S
5,6,0,3,"Moran, Mr. James",male,0.0,0,0,330877,8.4583,1,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,1,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,1,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,1,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,1,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,1,Q

In [27]:
df.first

<bound method NDFrame.first of      PassengerId  Survived  Pclass  \
0              1         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
5                                     Moran, Mr. James    male   0.0      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   0.0      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch      Ticket     Fare Cabin Embarked
0        0   A/5 21171   7.2500     1        S
5        0      330877   8.4583     1        Q
6        0       17463  51.8625   E46        S
7        1      349909  21.0750     1        S
8        2      347742  11.1333     1        S
..     ...         ...      ...   ...      ...
886      0      211536  13.0000     1        S
887      0      112053  30.0000   B42        S
888      2  W./C. 6607  23.4500     1        S
889      0      111369  30.0000  C148        C
890      0      370376   7.7500     1        Q

[887 rows x 12 columns]>

In [28]:
idcices = df[df["Pclass"]==3].index[:5]
df.loc[idcices, "Pclass"]== 9

0     False
5     False
7     False
8     False
10    False
Name: Pclass, dtype: bool

In [31]:
df.duplicated()

0      False
5      False
6      False
7      False
8      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 887, dtype: bool

In [32]:
df.duplicated().sum()

np.int64(0)

In [33]:
df.drop_duplicates()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,1,S
5,6,0,3,"Moran, Mr. James",male,0.0,0,0,330877,8.4583,1,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,1,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,1,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,1,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,1,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,1,Q

In [ ]:
df.rename(columns= {"Name": "Naam"}, inplace= True)
df

,PassengerId,Survived,Pclass,Naam,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,1,S
5,6,0,3,"Moran, Mr. James",male,0.0,0,0,330877,8.4583,1,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,1,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,1,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,1,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,1,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,1,Q

In [36]:
# df["Name"] = df["Name"].map({"Kabir": "K", "Sameer": "S", "Rohit": "R"})
df.columns = df.columns.map({"Naam": "FullName", "Age": "Years", "Marks": "Score"})
df

,NaN,NaN,NaN,FullName,NaN,Years,NaN,NaN,NaN,NaN,NaN,NaN
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,1,S
5,6,0,3,"Moran, Mr. James",male,0.0,0,0,330877,8.4583,1,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,1,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,1,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,1,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,2,W./C. 6607,23.4500,1,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,1,Q

In [ ]:
df['Naam'] = df['Naam']
#sabse phle chunk pdhane bolna hai

In [ ]:
df = pd.read_csv("dask_csv_demo_files/*.csv")
import glob

OSError: [Errno 22] Invalid argument: 'dask_csv_demo_files/*.csv'